%  x1=1:1:2;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
%  x2=1:1:3;
%  x3=1:1:4;
%  a=[20.45,30.69]; %a数据y值
%  b=[13.42,17.15,18.67]; %b数据y值
%  c=[9.93,11.79,12.58,13.01];
%  plot(x1,a,'-*b',x2,b,'-or',x3,c,'-xg');
%  
% axis([0,5,5,35])  %确定x轴与y轴框图大小
% 
% set(gca,'XTick',[1:1:4]) %x轴范围1-6，间隔1
% set(gca,'yticklabel',[5:5:35]) %y轴范围0-700，间隔100
% xlb=get(gca,'yticklabel');%得到bai原本dux轴的标注，是zhi一列字符串不含百分号
% n=length(xlb);%得到标注的个数，即长dao度
% a='%';
% per=repmat(a,n,1);%构造一个相同长度的%的列
% new_xlb=[xlb,per];%把百分号加到原标注的后面，即两个列字符串拼起来
% set(gca,'yticklabel',new_xlb); %将新的标注设为当前x轴的标注
% 
% legend('blocksize:16x16','blocksize:32x32','blocksize:64x64');   %右上角标注
% xlabel('MSB')  %x轴坐标描述
% ylabel('Similarity rate') %y轴坐标描述


%  x=1:1:8;
%  a=[92,88,80,76,69,63,60,58];
%  b=[98,98,95,95,95,89,89,89];
%  plot(x,b,'-or',x,a,'-*b','LineWidth',1.25);
% 
% axis([0,9,50,100])  %确定x轴与y轴框图大小
% 
% set(gca,'xticklabel',{'','(16x16, 2)','(16x16, 1)','(32x32, 3)','(32x32, 2)','(32x32, 1)','(64x64, 3)','(64x64, 2)','(64x64, 1)',''})
% set(gca,'yticklabel',[50:5:100]) %y轴范围0-700，间隔100
% 
% xlb=get(gca,'yticklabel');%得到bai原本dux轴的标注，是zhi一列字符串不含百分号
% n=length(xlb);%得到标注的个数，即长dao度
% a='%';
% per=repmat(a,n,1);%构造一个相同长度的%的列
% new_xlb=[xlb,per];%把百分号加到原标注的后面，即两个列字符串拼起来
% set(gca,'yticklabel',new_xlb); %将新的标注设为当前x轴的标注
% xlabel('(Block size, \rho)')  %x轴坐标描述
% ylabel('Success Ratio') %y轴坐标描述
% legend('origin','PRA-TPE');
% set(gcf,'position',[50,50,750,500])

%  x=1:1:8;
%  a=[4.3193,4.3131,4.3275,4.3234,4.2998,4.3314,4.3197,4.3123]; %a数据y值
%  b=[4.0006,3.9999,4.0256,4.0178,3.9837,4.0238,4.0172,3.9989]; %b数据y值
%  c=[3.7937,3.7886,3.8399,3.8023,3.8106,3.8412,3.8227,3.8174];
%  d=[4.3275,4.3275,4.3275,4.3275,4.3275,4.3275,4.3275,4.3275];
%  e=[4.0256,4.0256,4.0256,4.0256,4.0256,4.0256,4.0256,4.0256];
%  f=[3.8694,3.8694,3.8694,3.8694,3.8694,3.8694,3.8694,3.8694];
%  plot(x,a,'-*b',x,b,'-ob',x,c,'-xb',x,d,'-*r',x,e,'-or',x,f,'-xr','LineWidth',1.25);
%  
% axis([0,9,3.625,4.625])  %确定x轴与y轴框图大小
% 
% set(gca,'xticklabel',{'','(16x16, 1)','(16x16, 2)','(32x32, 1)','(32x32, 2)','(32x32, 3)','(64x64, 1)','(64x64, 2)','(64x64, 3)',''})
% set(gca,'YTick',[3.625:0.125:4.625]) %y轴范围0-700，间隔100
% 
% legend('full-body by PRA-TPE','bust by PRA-TPE','avatar by PRA-TPE','full-body by Stream Cipher','bust by Stream Cipher','avatar by Stream Cipher');   %右上角标注
% xlabel('(Block size, \rho)')  %x轴坐标描述
% ylabel('Ratio') %y轴坐标描述
% set(gcf,'position',[50,50,750,500])


%  x=1:1:8;
%  a=[292912,401408,460800,492032,508032,516128,520200,522242]; %a数据y值
%  b=[292612,398204,457070,488022,503878,511911,515937,517963]; %b数据y值
%  c=[292606,398200,457159,488098,503952,511982,516009,518032];
%  d=[292599,398195,457149,488144,503994,512025,516047,518071];
%  plot(x,a,'-*b',x,b,'-or',x,c,'-xg',x,d, '-Hy');
%  
% axis([0,9,280000,530000])  %确定x轴与y轴框图大小
% 
% set(gca,'xticklabel',{'','8','16','32','64','128','256','512','1024',''})
% set(gca,'YTick',[290000:20000:520000]) %y轴范围0-700，间隔100
% 
% legend('original','PRA-TPE of 16x16','PRA-TPE of 32x32','PRA-TPE of 64x64','location','Best');   %右上角标注
% xlabel('blocksize')  %x轴坐标描述
% ylabel('capacity') %y轴坐标描述
% set(gcf,'position',[50,50,750,500])


%  x=[8,16,32,64,128];
%  a=[0.6190,0.8026,0.8531,0.8843,0.9141]; %a数据y值
%  b=[0.5990,0.7761,0.8301,0.8645,0.8981]; %b数据y值
%  c=[0.5312,0.7475,0.8177,0.8551,0.8908];
%  d=[0.5459,0.7370,0.8045,0.8434,0.8812];
%  e=[0.5315,0.7123,0.7921,0.8380,0.8769];
%  f=[0.5409,0.7147,0.7866,0.8314,0.8715];
%  plot(x,a,'-*r',x,b,'-og',x,c,'-xy',x,d,'-*k',x,e,'-om',x,f,'-xb','LineWidth',0.7);
%  
% axis([0,150,0.5,1])  %确定x轴与y轴框图大小
% 
% set(gca,'XTick',[8,16,32,64,128]);
% set(gca,'YTick',[0.5:0.1:1]) %y轴范围0-700，间隔100
% 
% legend('block size: 16x16, \rho=2','block size: 16x16, \rho=1','block size: 32x32, \rho=2','block size: 32x32, \rho=1','block size: 64x64, \rho=2','block size: 64x64, \rho=1','location','Best');   %右上角标注
% xlabel('(Block wide of thumbnail)')  %x轴坐标描述
% ylabel('SSIM') %y轴坐标描述
% set(gcf,'position',[50,50,750,500])


%  x=[1,2,4,8,16,32,64,128];
%  a=[8.5579,11.3336,12.8376,13.6612,14.0225,14.2970,14.7399,15.5212]; %a数据y值
%  b=[8.5066,11.0050,12.1796,12.7279,13.0110,13.2725,13.7024,14.4667]; %b数据y值
%  c=[8.0880,10.5282,11.6581,12.1744,12.5210,12.8714,13.2944,14.0481];
%  d=[8.0881,10.4019,11.3894,11.7933,12.0690,12.3908,12.7989,13.5480];
%  e=[7.8722,10.1552,11.1252,11.5238,11.7816,12.1069,12.5984,13.3428];
%  f=[7.8833,10.1094,11.0138,11.3652,11.5905,11.8846,12.3493,13.0897];
%  plot(x,a,'-*r',x,b,'-og',x,c,'-xy',x,d,'-*k',x,e,'-om',x,f,'-xb','LineWidth',0.7);
%  
% axis([0,150,5,17])  %确定x轴与y轴框图大小
% 
% set(gca,'XTick',[4,8,16,32,64,128]);
% set(gca,'YTick',[5:2:17]) %y轴范围0-700，间隔100
% 
% legend('block size: 16x16, \rho=2','block size: 16x16, \rho=1','block size: 32x32, \rho=2','block size: 32x32, \rho=1','block size: 64x64, \rho=2','block size: 64x64, \rho=1','location','Best');   %右上角标注
% xlabel('(Block wide of thumbnail)')  %x轴坐标描述
% ylabel('PSNR') %y轴坐标描述
% set(gcf,'position',[50,50,750,500])

%  x=1:1:8;
%  a=[100,100,100,100,100,100,100,100];
%  b=[99.5,99.5,97.2,97.2,1.0,1.0,0.7,0.7];
%  c=[2.8,0,0,0,0,0,0,0];
%  d=[88.7,85.1,60.6,24.6,0.5,0.4,0.1,0];
%  plot(x,a,'-or',x,b,'-*b',x,d,'-xy',x,c,'-*g','LineWidth',0.9);
% 
% axis([0,9,0,100])  %确定x轴与y轴框图大小
% 
% set(gca,'xticklabel',{'','(16x16, 2)','(16x16, 1)','(32x32, 2)','(32x32, 1)','(64x64, 2)','(64x64, 1)','(128x128,2)','(128x128,1)',''})
% set(gca,'yticklabel',[0:10:110]) %y轴范围0-700，间隔100
% 
% xlb=get(gca,'yticklabel');%得到bai原本dux轴的标注，是zhi一列字符串不含百分号
% n=length(xlb);%得到标注的个数，即长dao度
% a='%';
% per=repmat(a,n,1);%构造一个相同长度的%的列
% new_xlb=[xlb,per];%把百分号加到原标注的后面，即两个列字符串拼起来
% set(gca,'yticklabel',new_xlb); %将新的标注设为当前x轴的标注
% xlabel('(Block size, \rho)')  %x轴坐标描述
% ylabel('Success Ratio') %y轴坐标描述
% legend('original image','original thumbnail','cipher thumbnail','cipher image');
% set(gcf,'position',[50,50,750,500])

 x=1:1:8;
 a=[55.85,54.88,55.26,54.37,0.98,0.49,0.20,0];
 b=[7.78,1.65,0.04,0.02,0,0,0,0];
 plot(x,a,'-or',x,b,'-*b','LineWidth',0.9);

axis([0,9,0,60])  %确定x轴与y轴框图大小

set(gca,'xticklabel',{'','(16x16, 2)','(16x16, 1)','(32x32, 2)','(32x32, 1)','(64x64, 2)','(64x64, 1)','(128x128,2)','(128x128,1)',''})
set(gca,'yticklabel',[0:5:65]) %y轴范围0-700，间隔100
xlabel('(Block size, \rho)')  %x轴坐标描述
ylabel('compare score') %y轴坐标描述
legend('original image vs. cipher image','original thumbnail vs. cipher thumbnail');
set(gcf,'position',[50,50,750,500])